app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "New Posts"], ["description", "Author_ID "], ["created_at", "2020-07-25 22:30:49.485960"], ["updated_at", "2020-07-25 22:30:49.485960"], ["author_id", 3]]
---
  def create
    @post = Post.new(post_params)
    @post.save